Tekla Open API Reference for Tekla Structures 2025
LeaderLine.LeaderLineType Property
 Gets the type of the leader line. For a list of the available leader line types see LeaderLine.LeaderLineTypes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public LeaderLine.LeaderLineTypes LeaderLineType { get; }
Public ReadOnly Property LeaderLineType As LeaderLine.LeaderLineTypes
	Get
Property Value
Type: LeaderLine.LeaderLineTypes
See Also
Reference
LeaderLine Class
Tekla.Structures.Drawing Namespace